{
  "users": [
    { "id": 1, "name": "Elvis Presley" },
    { "id": 2, "name": "Chris Brown" },
    { "id": 3, "name": "Billy Joel" },
    { "id": 4, "name": "Bruno Mars" },
    { "id": 5, "name": "Katy Perry" }
  ],
  "posts": [
    { "id": 1, "body": "Elvis Aaron Presley[a] (January 8, 1935 – August 16, 1977), also known mononymously as Elvis, was an American singer and actor. Known as the 'King of Rock and Roll', he is regarded as one of the most significant cultural figures of the 20th century. Presley's energized interpretations of songs and sexually provocative performance style, combined with a singularly potent mix of influences across color lines during a transformative era in race relations, brought both great success and initial controversy.", "userId": 1 },
    { "id": 2, "body": "some comment", "userId": 3 },
    { "id": 3, "body": "some comment", "userId": 2 },
    { "id": 4, "body": "some comment", "userId": 4 },
    { "id": 5, "body": "some comment", "In November 1956, Presley made his film debut in Love Me Tender. Drafted into military service in 1958, he relaunched his recording career two years later with some of his most commercially successful work. Presley held few concerts, however, and guided by Parker, proceeded to devote much of the 1960s to making Hollywood films and soundtrack albums, most of them critically derided. Some of Presley's most famous films included Jailhouse Rock (1957), Blue Hawaii (1961), and Viva Las Vegas (1964). In 1968, following a seven-year break from live performances, he returned to the stage in the acclaimed NBC television comeback special Elvis, which led to an extended Las Vegas concert residency and a string of highly profitable tours. In 1973, Presley gave the first concert by a solo artist to be broadcast around the world, Aloha from Hawaii. However, years of prescription drug abuse and unhealthy eating habits severely compromised his health, and Presley died unexpectedly in August, 1977 at his Graceland estate at the age of 42.": 1 },
    { "id": 6, "body": "some comment", "userId": 5 },
    { "id": 7, "body": "some comment", "userId": 3 },
    { "id": 8, "body": "some comment", "userId": 5 },
    { "id": 9, "body": "some comment", "userId": 2 },
    { "id": 10, "body": "some comment", "userId": 4 }
  ]
}