{
  "users": [
    { "id": 1, "name": "Elvis Presley" },
    { "id": 2, "name": "Chris Brown" },
    { "id": 3, "name": "Bon Jovi" },
    { "id": 4, "name": "Bruno Mars" },
    { "id": 5, "name": "Katy Perry" }
  ],
  "posts": [
    { "id": 1, "body": "Elvis Aaron Presley (January 8, 1935 – August 16, 1977), also known mononymously as Elvis, was an American singer and actor. Known as the 'King of Rock and Roll', he is regarded as one of the most significant cultural figures of the 20th century. Presley's energized interpretations of songs and sexually provocative performance style, combined with a singularly potent mix of influences across color lines during a transformative era in race relations, brought both great success and initial controversy.", "userId": 1 },
    { "id": 2, "body": "Bon Jovi is an American rock band formed in 1983 in Sayreville, New Jersey. The band currently consists of singer Jon Bon Jovi, keyboardist David Bryan, drummer Tico Torres, guitarist Phil X, and bassist Hugh McDonald.[1] Original bassist Alec John Such left the band in 1994, and longtime guitarist and co-songwriter Richie Sambora left in 2013. The band has been credited with 'bridging the gap between heavy metal, rock and pop with style and ease'.", "userId": 3 },
    { "id": 3, "body": "Christopher Maurice Brown (born May 5, 1989) is an American singer, songwriter, dancer, and actor. He's regarded as one of the most prominent artists in R&B music, being credited as an evolver of the genre, and often being referred to by contemporaries as the 'King of R&B'. His R&B has been characterized by several influences from other genres, mainly pop music and hip hop. His lyrics develop predominantly over emotional and hedonistic themes. Brown has had wide comparisons to Michael Jackson for his singing and dancing abilities, as well as for his stage presence.", "userId": 2 },
    { "id": 4, "body": "Peter Gene Hernandez (born October 8, 1985), known professionally as Bruno Mars, is an American singer-songwriter and record producer. He is known for his stage performances, retro showmanship, and for performing in a wide range of musical styles, including pop, R&B, funk, soul, reggae, disco, and rock. Mars is accompanied by his band, the Hooligans, who play a variety of instruments, such as electric guitar, bass, piano, keyboards, drums, and horns, and also serve as backup singers and dancers.", "userId": 4 },
    { "id": 5, "body": "In November 1956, Presley made his film debut in Love Me Tender. Drafted into military service in 1958, he relaunched his recording career two years later with some of his most commercially successful work. Presley held few concerts, however, and guided by Parker, proceeded to devote much of the 1960s to making Hollywood films and soundtrack albums, most of them critically derided. Some of Presley's most famous films included Jailhouse Rock (1957), Blue Hawaii (1961), and Viva Las Vegas (1964). In 1968, following a seven-year break from live performances, he returned to the stage in the acclaimed NBC television comeback special Elvis, which led to an extended Las Vegas concert residency and a string of highly profitable tours. In 1973, Presley gave the first concert by a solo artist to be broadcast around the world, Aloha from Hawaii. However, years of prescription drug abuse and unhealthy eating habits severely compromised his health, and Presley died unexpectedly in August, 1977 at his Graceland estate at the age of 42.", "userId": 1 },
    { "id": 6, "body": "Katheryn Elizabeth Hudson (born October 25, 1984), known professionally as Katy Perry, is an American singer, songwriter and television personality. She is known for her influence on modern pop music and her camp style, being dubbed the 'Queen of Camp' by Vogue and Rolling Stone. At 16, Perry released a gospel record titled Katy Hudson (2001) under Red Hill Records, which was commercially unsuccessful. She moved to Los Angeles at 17 to venture into secular music, and later adopted the stage name 'Katy Perry' from her mother's maiden name. She recorded an album while signed to Columbia Records, but was dropped before signing to Capitol Records.", "userId": 5 },
    { "id": 7, "body": "By mid-1982, out of school and working part-time at a women's shoe store, Jon Bon Jovi took a job at the Power Station Studios, a Manhattan recording facility where his cousin Tony Bongiovi was co-owner. Jon made several demos – including one produced by Billy Squier – and sent them to record companies, though failing to make an impact. His first professional recording was as lead vocals in 'R2-D2 We Wish You a Merry Christmas,' which was part of the Christmas in the Stars album which his cousin co-produced.", "userId": 3 },
    { "id": 8, "body": "Perry is one of the best-selling music artists of all time, having sold over 143 million records worldwide. She has the most U.S. diamond certified singles for any female artist (4). All of her studio albums released under Capitol have individually surpassed one billion streams on Spotify.[1] She has nine U.S. number one singles, three U.S. number one albums and has received various accolades, including a Billboard Spotlight Award (currently the only female artist to have one), four Guinness World Records, five Billboard Music Awards, five American Music Awards, a Brit Award, and a Juno Award. Perry has been included in the annual Forbes lists of highest-earning women in music from 2011 to 2019. Outside of music, she released an autobiographical documentary titled Katy Perry: Part of Me in 2012, voiced Smurfette in The Smurfs film series, and launched her own shoe line Katy Perry Collections in 2017. Perry began serving as a judge on American Idol during its sixteenth season in 2018. She is also the second most-followed woman and the sixth most-followed person on Twitter, with over 107 million followers.", "userId": 5 },
    { "id": 9, "body": "At age 13, Brown was discovered by Hitmission Records, a local production team that visited the gas station where his father worked, while searching for new talent.[59] Around the same time, he performed with one of his production managers’ son, named TJ, for hip hop artist Puff Daddy, but the rapper refused to sign him to his record label Bad Boy Records.[60] Hitmission's Lamont Fleming provided voice coaching for Brown. The team helped to arrange a demo package, under the name of 'C. Sizzle', and approached contacts in New York. Tina Davis, senior A&R executive at Def Jam Recordings, heard the demo package that Brown's local team had sent to Def Jam, and among the artists contained in the CD she was impressed by Brown with his track 'Whose Girl Is That'.[61] Davis later had Brown auditioning in her New York office, and she immediately took him to meet the former president of the Island Def Jam Music Group, Antonio 'L.A.' Reid, who offered to sign him that day, but Brown refused his proposal because Reid wouldn't talk to his mother.[62] Brown then started to sojourn in Harlem, New York, to seek a record deal.[63] The negotiations with Def Jam continued for two months, and ended when Davis lost her job due to a corporate merger. Brown asked her to be his manager, and once Davis accepted, she promoted the singer to other labels such as Jive Records, J-Records and Warner Bros. Records. 'I knew that Chris had real talent,' says Davis. 'I just knew I wanted to be part of it.'[64] Brown attended Essex High School in Virginia until late 2004, when he moved to New York to pursue his music career.", "userId": 2 },
    { "id": 10, "body": "Mars has sold over 130 million records worldwide, making him one of the best-selling music artists of all time. Eight of his songs have reached number one on the Billboard Hot 100 and his concert tours are some of the highest-grossing in history. He has received 15 Grammy Awards (including three Record of the Year wins), four Brit Awards, eleven American Music Awards, 13 Soul Train Awards and holds three Guinness World Records, among other accolades. He featured on Music Week's best songwriters (2011) and Billboard's Greatest of All Time Artists (2019) lists and rankings such as the Time 100 and Forbes Celebrity 100. Mars became the first artist to receive six Diamond-certified songs in the United States and has been regarded as a pop icon due to his influential career.", "userId": 4 }
  ],
  "albums": [
    { "id": 1, "name": "Elvis' Christmas Album", "year": "1957", "userId": 1 },
    { "id": 2, "name": "Elvis Now", "year": "1972", "userId": 1 },
    { "id": 3, "name": "Elvis in Concert", "year": "1977", "userId": 1 },
    { "id": 4, "name": "Indigo", "year": "2019", "userId": 2 },
    { "id": 5, "name": "Breezy", "year": "2022", "userId": 2 },
    { "id": 6, "name": "Royalty", "year": "2015", "userId": 2 },
    { "id": 7, "name": "New Jersey", "year": "1988", "userId": 3 },
    { "id": 8, "name": "Keep the Faith", "year": "1992", "userId": 3 },
    { "id": 9, "name": "Have a Nice Day", "year": "2005", "userId": 3 },
    { "id": 10, "name": "The Lost Planet", "year": "2010", "userId": 4 },
    { "id": 11, "name": "Unorthodox Jukebox", "year": "2012", "userId": 4 },
    { "id": 12, "name": "24K Magic", "year": "2016", "userId": 4 },
    { "id": 13, "name": "Teenage Dream", "year": "2010", "userId": 5 },
    { "id": 14, "name": "Witness", "year": "2017", "userId": 5 },
    { "id": 15, "name": "Smile", "year": "2020", "userId": 5 }
  ]
}